open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_sai.c
/****************************************************************************
 * arch/arm/src/stm32n6/stm32n6_sai.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.
 * The ASF licenses this file to you under the Apache License, Version
 * 2.0 (the "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or
 * implied.  See the License for the specific language governing
 * permissions and limitations under the License.
 *
 * STM32N6 SAI driver for NuttX.
 * Serial Audio Interface for microphone input (MEMS mic via I2S).
 *
 * Adapted from STM32F7 NuttX reference (stm32_sai.c).
 * Reference: STM32N6 HAL (stm32n6xx_hal_sai.c)
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/semaphore.h>
#include <syslog.h>
#include <string.h>

#include "arm_internal.h"
#include "stm32n6_dma.h"
#include "stm32n6_gpio.h"
#include "stm32n6_sai.h"

/* memorymap first: the RCC header derives every register address from
 * STM32_RCC_BASE, which that header owns.
 */

#include "hardware/stm32_memorymap.h"
#include "hardware/stm32_rcc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* SAI1 base address (per CMSIS stm32n647xx.h). The driver's register
 * offsets below (SAI_CR1_OFFSET=0x04, etc.) are relative to this base
 * and already encode the CMSIS Block A control-register placement
 * (SAI_Block_TypeDef starting at SAI1_BASE + 0x04), matching the
 * Renode STM32N6_SAI model's absolute offsets from the sai1 base.
 */

#define STM32N6_SAI1_BASE   0x42005800

/* SAI register offsets (per block: 0x20 spacing) */

#define SAI_CR1_OFFSET      0x04
#define SAI_CR2_OFFSET      0x08
#define SAI_FRCR_OFFSET     0x0C
#define SAI_SLOTR_OFFSET    0x10
#define SAI_IMR_OFFSET      0x14
#define SAI_SR_OFFSET       0x18
#define SAI_CLRFR_OFFSET    0x1C
#define SAI_DR_OFFSET       0x20

/* SAI_CR1 bits */

#define SAI_CR1_SAIEN       (1 << 16)
#define SAI_CR1_DMAEN       (1 << 17)
#define SAI_CR1_MODE_MASK   (3 << 0)
#define SAI_CR1_MODE_RX     (2 << 0)
#define SAI_CR1_DS_MASK     (7 << 5)
#define SAI_CR1_DS_16BIT    (4 << 5)
#define SAI_CR1_DS_24BIT    (6 << 5)
#define SAI_CR1_LSBFIRST    (1 << 12)
#define SAI_CR1_CKSTR       (1 << 9)
#define SAI_CR1_MCKDIV_MASK (0x3F << 20)

/* SAI_FRCR bits (frame control) */

#define SAI_FRCR_FRL_MASK   (0xFF << 0)  /* Frame length */
#define SAI_FRCR_FSALL_MASK (0x3F << 8)  /* FS active level length */

/* SAI_SLOTR bits */

#define SAI_SLOTR_FBOFF_MASK (0x1F << 0)
#define SAI_SLOTR_SLOTSZ_MASK (3 << 6)
#define SAI_SLOTR_SLOTSZ_16B  (1 << 6)  /* one 16-bit sample per slot */
#define SAI_SLOTR_NBSLOT_MASK (0xF << 8)
#define SAI_SLOTR_SLOTEN_MASK (0xFFFF << 16)

/* SAI status bits */

#define SAI_SR_FREQ         (1 << 3)
#define SAI_SR_OVRUDR       (1 << 0)

/* Audio constants */

#define SAI_DEFAULT_MCLK_DIV  4  /* MCLK = HCLK / 4 */

/* --- playback ------------------------------------------------------------ */

/* Register fields the input path never touched.  Transcribed from the SAI
 * block's definitions rather than guessed: CKSTR selects which edge data
 * changes on, MCKEN drives MCLK out to the codec, and FSDEF/FSOFF describe
 * how the frame sync relates to the first bit.
 */

#define SAI_CR1_CKSTR        (1 << 9)    /* data changes on falling edge (I2S) */
#define SAI_CR1_OUTDRIV     (1 << 13)    /* output drive enabled */
#define SAI_CR1_SAIEN       (1 << 16)    /* block enable */
#define SAI_CR1_MCKEN       (1 << 27)    /* master clock generation + output */
#define SAI_FRCR_FSDEF      (1 << 16)    /* FS = channel identification */
#define SAI_FRCR_FSOFF      (1 << 18)    /* FS starts before the first bit */
#define SAI_CR2_FTH_1QF     (1 << 0)     /* FIFO threshold 1/4 */
#define SAI_CR1_MCKDIV(d)   (((d) & 0x3f) << 20)  /* master clock divider */

#define SAI_TX_FRAME_BITS  32            /* 16-bit sample x 2 slots */
#define SAI_TX_ACTIVE_BITS 16
#define SAI_TX_SLOTS       2

#define SAI_TX_DMA_CHAN    1
#define SAI_TX_DMA_REQUEST 91            /* GPDMA1 request line: SAI1_A */

/* RCC bits this path needs.  The port's RCC header lists IC1/2/3/6/11/16/17/18
 * because those are the ones existing drivers use; SAI1 hangs off IC7, which
 * was not among them.  Offsets are the CMSIS struct's.
 */

#define STM32N6_RCC_IC7CFGR      (STM32_RCC_BASE + 0x00dc)

/* PLL reference-source encodings.  The port's RCC header has
 * RCC_PLL1CFGR1_SEL_HSE as (1 << 28), but the vendor HAL writes (2 << 28)
 * for HSE and uses (1 << 28) for MSI, with 0 meaning HSI.  PLL1 on this board
 * reads back SEL = 0 and runs at 64/4*75 = 1200 MHz, which confirms 0 is HSI
 * and therefore that the header's value is wrong.
 */

#define RCC_PLLSEL_HSI           (0 << 28)
#define RCC_PLLSEL_HSE           (2 << 28)
#define RCC_PLL2CFGR1_SEL_MASK   (7 << 28)
#define RCC_PLL2CFGR1_BYP        (1 << 27)
#define RCC_PLL2CFGR1_DIVM_MASK  (0x3f << 20)
#define RCC_PLL2CFGR1_DIVN_MASK  (0xfff << 8)
#define RCC_PLL2CFGR3_PDIV1_MASK (7 << 27)
#define RCC_PLL2CFGR3_PDIV2_MASK (7 << 24)
#define RCC_PLL2CFGR2_FRAC_MASK  (0xffffff)

/* The port's RCC header defines PLL2CFGR1 and PLL2CFGR3 but not CFGR2, which
 * holds the fractional part of DIVN.  Playback runs in integer mode and only
 * ever clears it, so it is spelled out here rather than added to the shared
 * header for a single zero write.
 */

#define STM32N6_RCC_PLL2CFGR2    (STM32_RCC_BASE + 0x0094)
#define RCC_DIVENR_IC7EN         (1 << 6)
#define RCC_APB2ENR_SAI1EN       (1 << 21)

/* PLL2, transcribed from the vendor BSP's 44.1 kHz case.  PLL2 is off on this
 * board and nothing else claims it: the NPU's IC6 stays on PLL1 by a
 * deliberate earlier decision, so borrowing PLL2 here disturbs nothing.
 */

#define SAI_PLL2_DIVM            (6)
#define SAI_PLL2_DIVN            (192)
#define SAI_PLL2_PDIV1           (4)
#define SAI_PLL2_PDIV2           (2)
#define SAI_IC7_DIV              (17)
#define SAI_HSE_HZ               (48000000)

/* Kernel clock reaching SAI1, and the divider its block needs.
 *
 * PLL2 drives IC7 and IC7 drives the block: 48 MHz / 6 * 192 / 4 / 17, which
 * comes to 22.58 MHz.  With NODIV clear the block's master clock is the
 * kernel clock divided by MCKDIV, one audio frame lasts 256 master clocks,
 * and so the divider that puts a frame out at the sample rate is
 *
 *   MCKDIV = kernel clock / (256 * Fs)
 *
 * which is 2 here, and is the same value the vendor HAL computes for the
 * same clock and the same request.  Zero is not a valid divider: the master
 * clock never runs, no frame is ever produced, the FIFO is never drained and
 * the request line is never asserted - the fill that had already reached the
 * FIFO just sits there, which is what a timeout looks like from above.
 */

