open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_sai.c
#define SAI_TX_KERNEL_HZ \
  (SAI_HSE_HZ / SAI_PLL2_DIVM * SAI_PLL2_DIVN / SAI_PLL2_PDIV1 / SAI_IC7_DIV)

#define SAI_TX_RATE_HZ          (44100)
#define SAI_TX_MCKDIV           (SAI_TX_KERNEL_HZ / (SAI_TX_RATE_HZ * 256))

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct stm32n6_sai_priv_s
{
  uint32_t base;
  sem_t    lock;
  sem_t    dma_wait;
  bool     initialized;
  struct sai_config_s config;
  sai_buffer_cb_t callback;
  void    *cb_arg;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct stm32n6_sai_priv_s g_sai1a_priv;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static inline uint32_t sai_getreg(
    struct stm32n6_sai_priv_s *priv, uint32_t offset)
{
  return *(volatile uint32_t *)(priv->base + offset);
}

static inline void sai_putreg(
    struct stm32n6_sai_priv_s *priv, uint32_t offset,
    uint32_t value)
{
  *(volatile uint32_t *)(priv->base + offset) = value;
}

static int sai_config_cr1(struct stm32n6_sai_priv_s *priv)
{
  uint32_t cr1 = 0;

  /* Mode: receiver */

  cr1 |= SAI_CR1_MODE_RX;

  /* Data size */

  if (priv->config.bits_per_sample == 24)
    {
      cr1 |= SAI_CR1_DS_24BIT;
    }
  else
    {
      cr1 |= SAI_CR1_DS_16BIT;
    }

  /* MCLK divider */

  cr1 |= (SAI_DEFAULT_MCLK_DIV << 20) &
          SAI_CR1_MCKDIV_MASK;

  /* Enable DMA */

  cr1 |= SAI_CR1_DMAEN;

  sai_putreg(priv, SAI_CR1_OFFSET, cr1);
  return 0;
}

static void sai_config_frame(struct stm32n6_sai_priv_s *priv)
{
  uint32_t frcr;
  uint32_t slotr;
  uint32_t frame_len;
  uint32_t slot_count;

  if (priv->config.channels == 2)
    {
      frame_len = priv->config.bits_per_sample * 2;
      slot_count = 2;
    }
  else
    {
      frame_len = priv->config.bits_per_sample;
      slot_count = 1;
    }

  /* Frame length and FS active level */

  frcr = ((frame_len - 1) & 0xff) |
         (((priv->config.bits_per_sample - 1) & 0x3f) << 8);
  sai_putreg(priv, SAI_FRCR_OFFSET, frcr);

  /* Slot configuration */

  slotr = (((priv->config.bits_per_sample - 1) & 0x3) << 6) |
          (((slot_count - 1) & 0xf) << 8) |
          (((1 << slot_count) - 1) << 16);
  sai_putreg(priv, SAI_SLOTR_OFFSET, slotr);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int stm32n6_sai_input_init(const struct sai_config_s *config)
{
  struct stm32n6_sai_priv_s *priv = &g_sai1a_priv;

  if (priv->initialized)
    {
      return 0;
    }

  priv->base = STM32N6_SAI1_BASE;
  priv->config = *config;

  nxsem_init(&priv->lock, 0, 1);
  nxsem_init(&priv->dma_wait, 0, 0);

  /* Disable SAI */

  sai_putreg(priv, SAI_CR1_OFFSET, 0);

  /* Configure CR1 */

  sai_config_cr1(priv);

  /* Configure frame and slot */

  sai_config_frame(priv);

  priv->initialized = true;

  syslog(LOG_INFO, "sai: initialized %luHz %ubit %uch\n",
         (unsigned long)config->sample_rate,
         config->bits_per_sample,
         config->channels);
  return 0;
}

int stm32n6_sai_input_start(sai_buffer_cb_t callback,
                              void *arg)
{
  struct stm32n6_sai_priv_s *priv = &g_sai1a_priv;

  if (!priv->initialized)
    {
      return -ENODEV;
    }

  priv->callback = callback;
  priv->cb_arg = arg;

  /* Enable SAI */

  sai_putreg(priv, SAI_CR1_OFFSET,
             sai_getreg(priv, SAI_CR1_OFFSET) |
             SAI_CR1_SAIEN);

  syslog(LOG_INFO, "sai: capture started\n");
  return 0;
}

int stm32n6_sai_input_stop(void)
{
  struct stm32n6_sai_priv_s *priv = &g_sai1a_priv;

  if (!priv->initialized)
    {
      return -ENODEV;
    }

  /* Disable SAI */

  sai_putreg(priv, SAI_CR1_OFFSET,
             sai_getreg(priv, SAI_CR1_OFFSET) &
             ~SAI_CR1_SAIEN);

  priv->callback = NULL;
  priv->cb_arg = NULL;

  syslog(LOG_INFO, "sai: capture stopped\n");
  return 0;
}

void stm32n6_sai_input_deinit(void)
{
  struct stm32n6_sai_priv_s *priv = &g_sai1a_priv;

  if (!priv->initialized)
    {
      return;
    }

  stm32n6_sai_input_stop();

  sai_putreg(priv, SAI_CR1_OFFSET, 0);

  priv->initialized = false;
  nxsem_destroy(&priv->lock);
  nxsem_destroy(&priv->dma_wait);

  syslog(LOG_INFO, "sai: deinitialized\n");
}


/* --- playback ------------------------------------------------------------ *
 *
 * SAI1 block A as master transmitter.  The codec is the slave and takes both
 * its bit clock and its MCLK from here, so the whole audio path hangs off
 * this block's kernel clock.
 */

/****************************************************************************
 * Name: stm32n6_sai_clock_config
 *
 * Description:
 *   Point SAI1's kernel clock at IC7 and start PLL2 feeding it.
 *
 *   PLL2 is off on this board and nothing else claims it: the NPU's IC6 was
 *   deliberately left on PLL1 (crossing to a second PLL cost more than the
 *   frequency bought back), and every other kernel clock in use is routed
 *   elsewhere.  So this is additive.
 *
 ****************************************************************************/

static int stm32n6_sai_clock_config(void)
{
  uint32_t regval;
  int      i;

  /* HSE first.
   *
   * The vendor's PLL2 settings are built around a 48 MHz reference.  This
   * board's PLL1 runs from HSI instead - IC6 and the NPU domain are clocked
   * from PLL1 at 1200 MHz, which is 64/4*75 and only works out from HSI - so
   * HSE is off at boot and has to be started before it can feed anything.
   *
   * Only PLL2 is taken from it.  PLL1, and with it SYSCLK, the NPU and every
   * other kernel clock, is left exactly as the FSBL set it up.
   */

  putreg32(getreg32(STM32_RCC_CR) | RCC_CR_HSEON, STM32_RCC_CR);

