open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_sai.c
  for (i = 0; i < 100000; i++)
    {
      if ((getreg32(STM32_RCC_SR) & RCC_SR_HSERDY) != 0)
        {
          break;
        }

      up_udelay(1);
    }

  if (i >= 100000)
    {
      syslog(LOG_ERR, "sai: HSE never started (SR=%08lx)\n",
             (unsigned long)getreg32(STM32_RCC_SR));
      return -ETIMEDOUT;
    }

  /* PLL2: source, dividers and post-dividers.  Read-modify-write on exactly
   * the fields the vendor HAL touches, so whatever else the FSBL left in
   * these registers survives - a blind write would clear bits nobody here
   * understands.  BYP goes with them: it is set at reset, and a bypassed PLL
   * ignores DIVM and DIVN entirely.
   */

  regval  = getreg32(STM32_RCC_PLL2CFGR1);
  regval &= ~(RCC_PLL2CFGR1_SEL_MASK | RCC_PLL2CFGR1_BYP |
              RCC_PLL2CFGR1_DIVM_MASK | RCC_PLL2CFGR1_DIVN_MASK);
  regval |= RCC_PLLSEL_HSE |
            ((uint32_t)SAI_PLL2_DIVM << 20) |
            ((uint32_t)SAI_PLL2_DIVN << 8);
  putreg32(regval, STM32_RCC_PLL2CFGR1);

  regval  = getreg32(STM32N6_RCC_PLL2CFGR2);
  putreg32(regval & ~RCC_PLL2CFGR2_FRAC_MASK, STM32N6_RCC_PLL2CFGR2);

  regval  = getreg32(STM32_RCC_PLL2CFGR3);
  regval &= ~(RCC_PLL2CFGR3_PDIV1_MASK | RCC_PLL2CFGR3_PDIV2_MASK);
  regval |= ((uint32_t)SAI_PLL2_PDIV1 << 27) |
            ((uint32_t)SAI_PLL2_PDIV2 << 24);
  putreg32(regval, STM32_RCC_PLL2CFGR3);

  /* Enable it.  Nothing locks before this: the previous version configured
   * a PLL that was never switched on, so the wait could only time out.
   */

  putreg32(getreg32(STM32_RCC_CR) | RCC_CR_PLL2ON, STM32_RCC_CR);

  for (i = 0; i < 100000; i++)
    {
      if ((getreg32(STM32_RCC_SR) & RCC_SR_PLL2RDY) != 0)
        {
          break;
        }

      up_udelay(1);
    }

  if (i >= 100000)
    {
      syslog(LOG_ERR, "sai: PLL2 never locked (SR=%08lx)\n",
             (unsigned long)getreg32(STM32_RCC_SR));
      return -ETIMEDOUT;
    }

  /* IC7 takes PLL2.  Its integer field holds the divider *minus one*, which
   * is what the vendor HAL writes.
   */

  putreg32(RCC_ICCFGR_SEL_PLL2 |
           ((uint32_t)(SAI_IC7_DIV - 1) << RCC_ICCFGR_INT_SHIFT),
           STM32N6_RCC_IC7CFGR);

  /* IC dividers have their own gate, off at reset.  Write-1-to-set alias. */

  putreg32(RCC_DIVENR_IC7EN, STM32_RCC_DIVENSR);

  /* And SAI1's APB2 gate. */

  putreg32(RCC_APB2ENR_SAI1EN, STM32_RCC_APB2ENSR);

  return 0;
}

/****************************************************************************
 * Name: stm32n6_sai_output_apply
 *
 * Description:
 *   Program the block.  Frame length 32 bits with 16 active, two 16-bit
 *   slots, FS before the first bit and active low: the standard I2S shape,
 *   and the one the vendor BSP uses.
 *
 *   NODIV stays clear, so the master clock comes from MCKDIV and works
 *   out at 256 * Fs: one frame per 256 master clocks, at 44.1 kHz.
 *
 ****************************************************************************/

static void stm32n6_sai_output_apply(struct stm32n6_sai_priv_s *priv)
{
  uint32_t cr1;
  uint32_t frcr;
  uint32_t slotr;

  cr1 = SAI_CR1_CKSTR | SAI_CR1_OUTDRIV | SAI_CR1_DMAEN | SAI_CR1_MCKEN |
        SAI_CR1_DS_16BIT |
        SAI_CR1_MCKDIV(SAI_TX_MCKDIV);

  frcr = ((SAI_TX_FRAME_BITS - 1) & 0xff) |
         SAI_FRCR_FSDEF | SAI_FRCR_FSOFF |
         (((SAI_TX_ACTIVE_BITS - 1) & 0x3f) << 8);

  slotr = SAI_SLOTR_SLOTSZ_16B |
          (((SAI_TX_SLOTS - 1) & 0xf) << 8) |
          (((1 << SAI_TX_SLOTS) - 1) << 16);

  /* Off while it is being programmed, then on.  MCLK starts with SAIEN, so
   * the codec is listening before the first sample arrives.
   */

  sai_putreg(priv, SAI_CR1_OFFSET, 0);
  sai_putreg(priv, SAI_CR2_OFFSET, SAI_CR2_FTH_1QF);
  sai_putreg(priv, SAI_FRCR_OFFSET, frcr);
  sai_putreg(priv, SAI_SLOTR_OFFSET, slotr);
  sai_putreg(priv, SAI_CR1_OFFSET, cr1 | SAI_CR1_SAIEN);
}

int stm32n6_sai_output_init(uint32_t sample_rate, uint8_t channels)
{
  struct stm32n6_sai_priv_s *priv = &g_sai1a_priv;
  int ret;

  /* Only the 44.1 kHz family has clock numbers transcribed from the vendor
   * BSP; every other rate wants a different PLL2 setting and divider.
   */

  if (sample_rate != 44100 || channels != 2)
    {
      syslog(LOG_ERR, "sai: playback is wired for 44.1 kHz stereo only\n");
      return -EINVAL;
    }

  priv->base = STM32N6_SAI1_BASE;
  priv->config.sample_rate    = sample_rate;
  priv->config.channels       = channels;
  priv->config.bits_per_sample = 16;

  ret = stm32n6_sai_clock_config();
  if (ret < 0)
    {
      /* No clock means no MCLK, which means no acknowledge from the codec
       * and a transmit block that never asks the DMA for anything.  Failing
       * here says why, instead of leaving a timeout three layers down.
       */

      return ret;
    }

  stm32n6_configgpio(GPIO_SAI1_FS_A);
  stm32n6_configgpio(GPIO_SAI1_SCK_A);
  stm32n6_configgpio(GPIO_SAI1_SD_A);
  stm32n6_configgpio(GPIO_SAI1_MCLK_A);

  stm32n6_sai_output_apply(priv);

  stm32n6_dma_init(SAI_TX_DMA_CHAN);

  priv->initialized = true;

  stm32n6_sai_output_dump();
  return 0;
}

/* Set once the channel has failed to complete a block.  Everything after
 * that goes out through the data register, which needs no request line.
 */

static bool g_sai_cpu_feed;

/****************************************************************************
 * Name: stm32n6_sai_output_feed
 *
 * Description:
 *   Hand the block two samples at a time, one frame per data register write.
 *
 *   The FIFO drains at the sample rate, so the hardware paces this by
 *   itself: a write is only made when there is room, and room appears 44100
 *   times a second.  Slower than the channel and it holds the CPU for the
 *   whole file, but it needs no request line, no channel and no memory
 *   attributes, so audio plays even when the channel does not complete.
 *
 ****************************************************************************/

static int stm32n6_sai_output_feed(FAR const int16_t *samples, uint32_t count)
{
  struct stm32n6_sai_priv_s *priv = &g_sai1a_priv;
  uint32_t last = clock_systime_ticks();
  uint32_t i    = 0;

  while (i < count)
    {
      if (((sai_getreg(priv, SAI_SR_OFFSET) >> 16) & 0xf) <= 4)
        {
          uint32_t word = (uint32_t)(uint16_t)samples[i];

          i++;

          if (i < count)
            {
              word |= (uint32_t)(uint16_t)samples[i] << 16;
              i++;
            }

          sai_putreg(priv, SAI_DR_OFFSET, word);
          last = clock_systime_ticks();
        }
      else if (clock_systime_ticks() - last > MSEC2TICK(500))
        {
          syslog(LOG_ERR, "sai: fifo did not drain, cpu feed abandoned\n");
          return -ETIMEDOUT;
        }
    }

