open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_sai.c
  return 0;
}


int stm32n6_sai_output_write(FAR const int16_t *samples, uint32_t count)
{
  struct stm32n6_sai_priv_s *priv = &g_sai1a_priv;
  uint32_t bytes;
  int      ret;

  if (!priv->initialized || samples == NULL || count == 0)
    {
      return -EINVAL;
    }

  bytes = count * sizeof(int16_t);

  /* One DMA block per call; the caller streams the file in chunks.  The
   * block length field is 16 bits.
   */

  if (bytes > 0xffff)
    {
      return -E2BIG;
    }

  /* The DMA reads this memory with the CPU's cache in the way otherwise. */

  up_clean_dcache((uintptr_t)samples, (uintptr_t)samples + bytes);

  if (g_sai_cpu_feed)
    {
      return stm32n6_sai_output_feed(samples, count);
    }

  ret = stm32n6_dma_start_m2p(SAI_TX_DMA_CHAN, (uint32_t)(uintptr_t)samples,
                              priv->base + SAI_DR_OFFSET, bytes,
                              SAI_TX_DMA_REQUEST, 1);
  if (ret < 0)
    {
      return ret;
    }

  ret = stm32n6_dma_wait(SAI_TX_DMA_CHAN, 1000);
  if (ret == -ETIMEDOUT)
    {
      /* The block has a clock and the codec is listening, so the audio can
       * go out without the channel.  Take the request line and the channel
       * out of the picture first, so nothing lands in the middle of the
       * transfer that follows, then feed the rest of the file from here.
       */

      stm32n6_dma_deinit(SAI_TX_DMA_CHAN);
      sai_putreg(priv, SAI_CR1_OFFSET,
                 sai_getreg(priv, SAI_CR1_OFFSET) & ~SAI_CR1_DMAEN);

      g_sai_cpu_feed = true;

      syslog(LOG_WARNING, "sai: no dma completion, feeding from the cpu "
             "instead\n");

      ret = stm32n6_sai_output_feed(samples, count);
    }

  return ret;
}


void stm32n6_sai_output_stop(void)
{
  struct stm32n6_sai_priv_s *priv = &g_sai1a_priv;

  if (!priv->initialized)
    {
      return;
    }

  stm32n6_dma_deinit(SAI_TX_DMA_CHAN);

  sai_putreg(priv, SAI_CR1_OFFSET,
             sai_getreg(priv, SAI_CR1_OFFSET) & ~SAI_CR1_SAIEN);

  priv->initialized = false;
}

void stm32n6_sai_output_dump(void)
{
  uint32_t cfgr1  = getreg32(STM32_RCC_PLL2CFGR1);
  uint32_t cfgr3  = getreg32(STM32_RCC_PLL2CFGR3);
  uint32_t ic7    = getreg32(STM32N6_RCC_IC7CFGR);
  uint32_t divm   = (cfgr1 >> 20) & 0x3f;
  uint32_t divn   = (cfgr1 >> 8) & 0xfff;
  uint32_t pdiv1  = (cfgr3 >> 27) & 0x7;
  uint32_t icint  = (ic7 >> RCC_ICCFGR_INT_SHIFT) & 0xff;
  uint32_t vco_khz;
  uint32_t ic_khz;
  uint32_t mckdiv;
  uint32_t us;
  uint32_t fflvl;
  int      i;

  if (divm == 0)
    {
      divm = 1;
    }

  if (pdiv1 == 0)
    {
      pdiv1 = 1;
    }

  vco_khz = (SAI_HSE_HZ / 1000 / divm) * divn;
  ic_khz  = vco_khz / pdiv1 / (icint + 1);

  mckdiv = (sai_getreg(&g_sai1a_priv, SAI_CR1_OFFSET) >> 20) & 0x3f;

  syslog(LOG_INFO, "sai: pll2 m=%lu n=%lu pdiv1=%lu -> vco %lu MHz; "
         "ic7 /%lu = %lu kHz; mckdiv %lu -> mclk %lu kHz, fs %lu Hz\n",
         (unsigned long)divm, (unsigned long)divn, (unsigned long)pdiv1,
         (unsigned long)(vco_khz / 1000), (unsigned long)(icint + 1),
         (unsigned long)ic_khz, (unsigned long)mckdiv,
         (unsigned long)(mckdiv != 0 ? ic_khz / mckdiv : 0),
         (unsigned long)(mckdiv != 0 ? ic_khz * 1000 / mckdiv / 256 : 0));

  syslog(LOG_INFO, "sai: cr1=%08lx cr2=%08lx frcr=%08lx slotr=%08lx "
         "sr=%08lx\n",
         (unsigned long)sai_getreg(&g_sai1a_priv, SAI_CR1_OFFSET),
         (unsigned long)sai_getreg(&g_sai1a_priv, SAI_CR2_OFFSET),
         (unsigned long)sai_getreg(&g_sai1a_priv, SAI_FRCR_OFFSET),
         (unsigned long)sai_getreg(&g_sai1a_priv, SAI_SLOTR_OFFSET),
         (unsigned long)sai_getreg(&g_sai1a_priv, SAI_SR_OFFSET));
  /* The divider gate lives in DIVENR; DIVENSR is the write-1-to-set alias and
   * reads back as zero, so the previous report of it said nothing at all.
   */

  syslog(LOG_INFO, "sai: ic7cfgr=%08lx divenr=%08lx (IC7EN=%lu)\n",
         (unsigned long)getreg32(STM32N6_RCC_IC7CFGR),
         (unsigned long)getreg32(STM32_RCC_DIVENR),
         (unsigned long)((getreg32(STM32_RCC_DIVENR) & RCC_DIVENR_IC7EN) ?
                         1 : 0));

  /* Clock probe.
   *
   * Push more words at the data register than the FIFO can hold, wait a
   * millisecond, and look at the level.  Eight words is under 200
   * microseconds of audio at 44.1 kHz, so a clocked block is empty by the
   * time this reads; an unclocked one is still full.  That one number says
   * whether the remaining problem is the clock or the DMA.
   */

  /* Clock probe: how long the block takes to empty its own FIFO.
   *
   * Eight words is 181 microseconds of audio at 44.1 kHz, so a clocked
   * block is empty by then and an unclocked one never empties at all.  One
   * number, and the range it has to be read over is five decades wide.
   */

  for (i = 0; i < 8; i++)
    {
      sai_putreg(&g_sai1a_priv, SAI_DR_OFFSET, 0);
    }

  for (us = 0; us < 2000; us += 50)
    {
      if (((sai_getreg(&g_sai1a_priv, SAI_SR_OFFSET) >> 16) & 0xf) == 0)
        {
          break;
        }

      up_udelay(50);
    }

  fflvl = (sai_getreg(&g_sai1a_priv, SAI_SR_OFFSET) >> 16) & 0xf;

  syslog(LOG_INFO, "sai: clock probe: fifo %lu of 8 left after about %lu us "
         "(44.1 kHz wants %lu)\n",
         (unsigned long)fflvl, (unsigned long)us,
         (unsigned long)(8 * 1000000UL / SAI_TX_RATE_HZ));
}

